#!/bin/bash
#############################################################################
#程序名:一键安装pssh
#功能描述:一键安装pssh
#作者:   liukai
#创建日期: 20190424
#输入:     日期 v_data_DATE              ($1)
#输出: res 
#系统变量： 执行上一个指令的返回值     ($?)
#############################################################################
#############################################################################
#  修改者:
#  修改日期:
#  修改内容:
##############################################################################
##主目录
v_parameter=$1
##需上传至目录
v_order=$2
pssh -${v_parameter}  ./conf/conf_ops/hosts  ${v_order}
pscp -h ./conf/conf_ops/hosts ${v_parameter} ${v_order}
